/**
 * 문자열로 변환
 * 
 * 문제 설명
 * 
 * 정수 n이 주어질 때, n을 문자열로 변환하여 return하도록 
 * solution 함수를 완성해주세요.
 * 
 * 제한 사항
 * 
 * - 1 ≤ n ≤ 10000
 * 
 * 입출력 예시
 * 
 * n	 result
 * 123	 "123"
 * 2573	 "2573"
 * 
 * 입출력 예시 설명
 * 
 * ex1) 123을 문자열로 변환한 "123"을 return합니다.
 * ex2) 2573을 문자열로 변환한 "2573"을 return합니다.
 * 
 */

/**
 * 문제 해석
 * 
 * n= 정수
 * 
 * 숫자를 문자형으로 변하게 하는 메서드 .toString()
 * 
 */

function solution (n) {
    return n.toString()
}

/**
 * toString() 메서드는 숫자형을 문자형으로 바꾸는 메서드 이다.
 * 
 * 숫자형.toString() 형식으로, 숫자형 -> "문자형" 으로 변환 한다.
 */


